import type { TypeResult } from '@/types';

export const typeResult: TypeResult = {
  SJ: {
    title: '완벽주의형',
    subTitle: '안전 제일',
    text: {
      tag: ['# 너는 다 계획이 있구나?', '# 알잘딱깔센'],
      desc: '‘알고 있다’는 심리적인 안정감이 중요한 유형이에요. 제대로 알고 있다는 확신이 없으면 실행하지 못하고 꼼꼼해서 하나하나 확인해야 직성이 풀려요.\n\n그러다 보니 확인이 안 된 상태에서 들은 정보는 잘 믿지 못해요. 선뜻 취업에 도전하기 겁이 나서 망설이거나, 지나치게 안정적인 전략을 선호하다 보니 진전이 보이지 않아 슬럼프에 빠지기도 해요.',
      tip: [
        {
          main: '명확한 목표를 설정하고\n그에 따른 일정을 계획해 준비하세요.',
          sub: '주먹구구식의 지식보다 체계적으로 기초부터 세운 지식을 신뢰하기 때문에 취업 전략을 세울 때는 명확한 목표와 스케줄을 따르는 것이 좋아요.',
        },
        {
          main: '예상치 못한 변수가 생기더라도\n끈기 있게 그 길을 가세요.',
          sub: '항상 규정이나 관습대로 흘러가지 않는 것이 있음을 인지해야 해요. 다소 복잡하고 어려운 일도 그 과정을 즐기며 잘 이겨낼 수 있는 유형이에요. ',
        },
      ],
    },
  },
  NT: {
    title: '천재 전략가형',
    subTitle: '통찰력 만렙 찍은',
    text: {
      tag: ['# 믿는 건 오직 나 자신', '# 물음표 빼면 시체'],
      desc: '문제를 분석하고 해결하는 능력이 뛰어나며 전략적으로 취업을 준비하는 편이에요. 어려운 문제를 맞닥뜨려도 냉정하고 객관적으로 대응하고 해결해요.\n\n완벽을 추구하며 지적 호기심이 높은 유형으로, 새로운 것을 배우고 성장하는 걸 즐겨서 새로운 분야나 산업에도 문제없이 도전하고 빠르게 적응할 수 있어요.',
      tip: [
        {
          main: '큰 틀을 보는 시각은 유지하되,\n세부 사항을 파악하는 것을 놓치지 마세요.',
          sub: '전반적인 상황이나 문제의 본질에 대한 이해력이 높지만 때로는 세부 사항에 대한 주의가 부족할 수 있어 이를 간과하지 않는 것이 중요해요.',
        },
        {
          main: '내면의 ‘진짜 취업 동기’를 찾는다면\n슬럼프도 쉽게 극복할 수 있어요.',
          sub: '단순히 ‘취업이 잘 되는 분야’ 등 외부적 요인보다자기 내부적 요인에 의한 동기를 찾아야 어디에 집중해야할 지를 알고, 진전을 보일 수 있어요.',
        },
      ],
    },
  },

  SP: {
    title: '현실주의형',
    subTitle: '한다면 하는',
    text: {
      tag: ['# 빠른 두뇌회전과 잔머리', '# 눈치 100단'],
      desc: '취준을 시작하기 전에는 귀찮아하는 경향이 있지만, 막상 시작하면 그 누구보다 열심히 하는 유형이에요. 즉, 해야겠다고 마음먹으면 빠르게 행동으로 옮겨요.\n\n현재의 정보를 있는 그대로 받아들이기 때문에 현실에 대한 수용력이 뛰어나 나 자신을 객관적으로 평가하고, 현실적인 취업 전략을 잘 세울 수 있어요.',
      tip: [
        {
          main: '큰 목표를 작은 단위로 나눠보세요.',
          sub: '예를 들어 큰 목표가 취업성공이라면 이력서 작성, 자소서 작성, 면접 준비 등의 더 작은 단위로 목표를 나눠보세요. 이때, 엄격한 계획보다는 유연한 계획을 세우는 것이 좋답니다.',
        },
        {
          main: '인내심을 길러야 해요.',
          sub: '효율적인 것만 찾다가 지루하게 느끼는 문제에 대해 인내심이 부족해질 수 있어요. 시간을 정해놓고 목표하는 것을 꾸준히 하다 보면 성취감과 함께 자연스럽게 인내심을 기를 수 있어요. ',
        },
      ],
    },
  },

  NF: {
    title: '외유내강형',
    subTitle: '부드러운 소신',
    text: {
      tag: ['# 말이나 글에 재능있음', '# 공감능력 뛰어남'],
      desc: '다양한 비전과 본질에 집중하며 많은 가능성을 열어두는 유형으로, 취준을 하면서도 특유의 통찰력과 강한 직관력으로 새로운 가능성을 탐색하고 도전해요.\n\n하지만 문제를 현실적으로 다루는데 어려움을 느끼거나 새로운 미래를 위해서 현재 해야 할 일을 간과할 수 있으니 주의해야 한답니다.',
      tip: [
        {
          main: '이상을 실현하기 위해 고려되어야 할\n현실적 조건을 세분화하세요.',
          sub: '업계 동향, 산업 환경, 직무 경쟁력 등 취업 전략을 수립하는 데 있어 현실적인 사항을 먼저 파악하고 나면 더 명확한 방향을 설정할 수 있어요.',
        },
        {
          main: '신뢰할 수 있는 사람들과 함께\n의논하고 조언을 구해보세요.',
          sub: '독단적인 결정보다는 소통을 통해 지식과 통찰력을 얻는 경향이 있기 때문에 믿을 수 있는 사람들과 이야기를 나눔으로써 다양한 시각을 수용하며 더 나은 결정을 내릴 수 있어요.',
        },
      ],
    },
  },
};
